
<?php
class HERO{
    /**
     * hero列表的key
     */
    const name = 0;
    const cost = 1;
    const group = 2;
    const img = 3;
    const lol_id = 4;
    const id = 5; // front
    const title = 6; // front

    /**
     * 羁绊列表的key
     */
    const g_name = 0;
    const g_img = 1;
    const g_glevel = 2;
    const g_level = 3;
    const g_id = 4;

    /**
     * 级别与英雄概率对应关系
     */
    const LEVEL2COST = [
        1=>[1],
        2=>[1],
        3=>[1,2,3],
        4=>[1,2,3],
        5=>[1,2,3,4],
        6=>[1,2,3,4],
        7=>[1,2,3,4,5],
        8=>[1,2,3,4,5],
        9=>[1,2,3,4,5],
        ];
    /**
     * 羁绊id定义
     */
    const G_MAP = [
        701 => "星之守护者",
        702 => "银河魔装机神",
        703 => "星神",
        704 => "奥德赛",
        705 => "未来战士",
        706 => "虚空",
        707 => "太空海盗",
        708 => "源计划",
        709 => "暗星",
        710 => "女武神",
        
        801 => "剑士",
        802 => "爆破专家",
        803 => "刺客",
        804 => "斗士",
        805 => "法师",
        806 => "圣盾使",
        807 => "狙神",
        808 => "秘术师",
        809 => "破法战士",
        810 => "强袭枪手",
        811 => "星舰龙神",
        812 => "佣兵",
        813 => "重装战士",

        "星之守护者" => 701,
        "银河魔装机神" => 702,
        "星神" => 703,
        "奥德赛" => 704,
        "未来战士" => 705,
        "虚空" => 706,
        "太空海盗" => 707,
        "源计划" => 708,
        "暗星" => 709,
        "女武神" => 710,
        
        "剑士" => 801,
        "爆破专家" => 802,
        "刺客" => 803,
        "斗士" => 804,
        "法师" => 805,
        "圣盾使" => 806,
        "狙神" => 807,
        "秘术师" => 808,
        "破法战士" => 809,
        "强袭枪手" => 810,
        "星舰龙神" => 811,
        "佣兵" => 812,
        "重装战士" => 813
    ];
    const HERO_ID = [
        // 200 => '黑暗之女 安妮',
        // 201 => '卡牌大师 崔斯特',
        // 202 => '德邦总管 赵信',
        // 203 => '正义天使 凯尔',
        // 204 => '无极剑圣 易',
        // 205 => '众星之子 索拉卡',
        // 206 => '赏金猎人 厄运小姐',
        // 207 => '寒冰射手 艾希',
        // 208 => '虚空恐惧 科加斯',
        // 209 => '恶魔小丑 萨科',
        // 210 => '琴瑟仙女 娑娜',
        // 211 => '虚空行者 卡萨丁',
        // 212 => '刀锋舞者 艾瑞莉娅',
        // 213 => '海洋之灾 普朗克',
        // 214 => '天启者 卡尔玛',
        // 215 => '皮城女警 凯特琳',
        // 216 => '蒸汽机器人 布里茨',
        // 217 => '熔岩巨兽 墨菲特',
        // 218 => '德玛西亚皇子 嘉文四世',
        // 219 => '孙悟空 齐天大圣',
        // 220 => '机械公敌 兰博',
        // 221 => '圣锤之毅 波比',
        // 222 => '探险家 伊泽瑞尔',
        // 223 => '铁铠冥魂 莫德凯撒',
        // 224 => '曙光女神 蕾欧娜',
        // 225 => '暮光之眼 慎',
        // 226 => '光辉女郎 拉克丝',
        // 227 => '远古巫灵 泽拉斯',
        // 228 => '九尾妖狐 阿狸',
        // 229 => '法外狂徒 格雷福斯',
        // 230 => '潮汐海灵 菲兹',
        // 231 => '无双剑姬 菲奥娜',
        // 232 => '爆破鬼才 吉格斯',
        // 233 => '仙灵女巫 璐璐',
        // 234 => '虚空掠夺者 卡兹克',
        // 235 => '诺克萨斯之手 德莱厄斯',
        // 236 => '未来守护者 杰斯',
        // 237 => '暗黑元首 辛德拉',
        // 238 => '铸星龙王 奥瑞利安·索尔',
        // 239 => '暮光星灵 佐伊',
        // 240 => '虚空之女 卡莎',
        // 241 => '疾风剑豪 亚索',
        // 242 => '虚空之眼 维克兹',
        // 243 => '戏命师 烬',
        // 244 => '暴走萝莉 金克丝',
        // 245 => '圣枪游侠 卢锡安',
        // 246 => '时间刺客 艾克',
        // 247 => '皮城执法官 蔚',
        // 248 => '魂锁典狱长 锤石',
        // 249 => '幻翎 洛',
        // 250 => '逆羽 霞',
        // 251 => '万花通灵 妮蔻',

        '黑暗之女 安妮' => 200,
        '卡牌大师 崔斯特' => 201,
        '德邦总管 赵信' => 202,
        '正义天使 凯尔' => 203,
        '无极剑圣 易' => 204,
        '众星之子 索拉卡' => 205,
        '赏金猎人 厄运小姐' => 206,
        '寒冰射手 艾希' => 207,
        '虚空恐惧 科加斯' => 208,
        '恶魔小丑 萨科' => 209,
        '琴瑟仙女 娑娜' => 210,
        '虚空行者 卡萨丁' => 211,
        '刀锋舞者 艾瑞莉娅' => 212,
        '海洋之灾 普朗克' => 213,
        '天启者 卡尔玛' => 214,
        '皮城女警 凯特琳' => 215,
        '蒸汽机器人 布里茨' => 216,
        '熔岩巨兽 墨菲特' => 217,
        '德玛西亚皇子 嘉文四世' => 218,
        '孙悟空 齐天大圣' => 219,
        '机械公敌 兰博' => 220,
        '圣锤之毅 波比' => 221,
        '探险家 伊泽瑞尔' => 222,
        '铁铠冥魂 莫德凯撒' => 223,
        '曙光女神 蕾欧娜' => 224,
        '暮光之眼 慎' => 225,
        '光辉女郎 拉克丝' => 226,
        '远古巫灵 泽拉斯' => 227,
        '九尾妖狐 阿狸' => 228,
        '法外狂徒 格雷福斯' => 229,
        '潮汐海灵 菲兹' => 230,
        '无双剑姬 菲奥娜' => 231,
        '爆破鬼才 吉格斯' => 232,
        '仙灵女巫 璐璐' => 233,
        '虚空掠夺者 卡兹克' => 234,
        '诺克萨斯之手 德莱厄斯' => 235,
        '未来守护者 杰斯' => 236,
        '暗黑元首 辛德拉' => 237,
        '铸星龙王 奥瑞利安·索尔' => 238,
        '暮光星灵 佐伊' => 239,
        '虚空之女 卡莎' => 240,
        '疾风剑豪 亚索' => 241,
        '虚空之眼 维克兹' => 242,
        '戏命师 烬' => 243,
        '暴走萝莉 金克丝' => 244,
        '圣枪游侠 卢锡安' => 245,
        '时间刺客 艾克' => 246,
        '皮城执法官 蔚' => 247,
        '魂锁典狱长 锤石' => 248,
        '幻翎 洛' => 249,
        '逆羽 霞' => 250,
        '万花通灵 妮蔻' => 251,
    ];
    //https://game.gtimg.cn/images/lol/act/img/tft/equip/317.png
    const WEAPON = [
        self::G_MAP['剑士'] => ['破败王者之剑','317.png'],
        self::G_MAP['刺客'] => ['刺客的利爪','324.jpg'],
        self::G_MAP['爆破专家'] => ['爆破专家的电荷','331.png'],
        self::G_MAP['星之守护者'] => ['星之守护者的挂坠','337.png'],
        self::G_MAP['奥德赛'] => ['奥德赛勋章','342.png'],
        self::G_MAP['星神'] => ['星神的法球','346.png'],
        self::G_MAP['圣盾使'] => ['圣盾使的胸甲','349.png'],
        self::G_MAP['暗星'] => ['暗星之心','352.png'],
    ];

    private static $group2hero;

    // public static $g_map = null;
    /**
     * 英雄map
     */
    public static $h_map = null;
    /**
     * 初始化
     */
    static public function init(){
        self::$h_map = self::HERO_ID;
        foreach(self::$h_map as $key => $item) {
            self::$h_map[$item] = $key;
        }
    }
    /**
     * 返回武器列表
     */
    static public function weaponList(){
        $ret = [];
        foreach(self::WEAPON as $groupId=>$item){
            $ret[$groupId] = [
                $item[1],
                $groupId,
                $item[0] . ' - 转职为' . self::G_MAP[$groupId],
                $item[0]
            ];
        }
        return $ret;
    }

    //不同数量阵营角色获取的buff级别
    const BF_1 = [ 1=>1 ];
    const BF_2 = [ 1=>0, 2=>2 ];
    const BF_2_4 = [ 1=>0, 2=>2, 3=>2, 4=>4 ];
    const BF_2_3_4 = [ 1=>0, 2=>2, 3=>3, 4=>4 ];
    const BF_2_4_6 = [ 1=>0, 2=>2, 3=>2, 4=>4, 5=>4, 6=>6 ];
    const BF_2_4_6_8 = [ 1=>0, 2=>2, 3=>2, 4=>4, 5=>4, 6=>6, 7=>6, 8=>8 ];
    const BF_3 = [ 1=>0, 2=>0, 3=>3 ];
    const BF_3_6 = [ 1=>0, 2=>0, 3=>3, 4=>3, 5=>3, 6=>6 ];
    const BF_3_6_9 = [ 1=>0, 2=>0, 3=>3, 4=>3, 5=>3, 6=>6, 7=>6, 8=>6, 9=>9 ];

    //返回阵营列表
    static public function groupList(){
        $group = [
            //id                        name                img     low mid top     group
            self::G_MAP['星之守护者']     => ['星之守护者',   3101,   [3,0,6],    self::BF_3_6],
            self::G_MAP['银河魔装机神']   => ['银河魔装机神', 3102,   [0,0,3],    self::BF_3],
            self::G_MAP['星神']           => ['星神',         3103,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['奥德赛']         => ['奥德赛',       3104,   [3,6,9],    self::BF_3_6_9],
            self::G_MAP['未来战士']       => ['未来战士',     3105,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['虚空']           => ['虚空',         3106,   [0,0,3],    self::BF_3],
            self::G_MAP['太空海盗']       => ['太空海盗',     3107,   [2,0,4],    self::BF_2_4],
            self::G_MAP['源计划']         => ['源计划',       3108,   [3,0,6],    self::BF_3_6],
            self::G_MAP['暗星']           => ['暗星',         3109,   [3,0,6],    self::BF_3_6_9],
            self::G_MAP['女武神']         => ['女武神',       3110,   [0,0,2],    self::BF_2],

            self::G_MAP['剑士']           => ['剑士',         3001,   [3,6,9],    self::BF_3_6_9],
            self::G_MAP['爆破专家']       => ['爆破专家',     3002,   [0,0,2],    self::BF_2],
            self::G_MAP['刺客']           => ['刺客',         3003,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['斗士']           => ['斗士',         3004,   [2,0,4],    self::BF_2_4],
            self::G_MAP['法师']           => ['法师',         3005,   [2,4,[6,8]],self::BF_2_4_6_8],
            self::G_MAP['圣盾使']         => ['圣盾使',       3006,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['狙神']           => ['狙神',         3007,   [0,0,2],    self::BF_2],
            self::G_MAP['秘术师']         => ['秘术师',       3008,   [2,0,4],    self::BF_2_4],
            self::G_MAP['破法战士']       => ['破法战士',     3009,   [0,0,2],    self::BF_2],
            self::G_MAP['强袭枪手']       => ['强袭枪手',     3010,   [2,0,4],    self::BF_2_4],
            self::G_MAP['星舰龙神']       => ['星舰龙神',     3011,   [0,0,1],    self::BF_1],
            self::G_MAP['佣兵']           => ['佣兵',         3012,   [0,0,1],    self::BF_1],
            self::G_MAP['重装战士']       => ['重装战士',     3013,   [2,0,4],    self::BF_2_4],
        ];

        foreach($group as $gid => &$item){
            $item[self::g_id] = $gid;
        }
        return $group;
    }
    
    //返回英雄列表 包含名称 价格 阵营 id
    static public function heroList(){
        /**
         * 英雄，价格，阵营，图片id，lol_id
         * https://game.gtimg.cn/images/lol/act/img/tft/js/chess.js
         */
        $hero_define = [
            self::$h_map['黑暗之女 安妮'] => ['黑暗之女 安妮',2,['银河魔装机神','法师'],128, 1],
            self::$h_map['卡牌大师 崔斯特'] => ['卡牌大师 崔斯特',1,['未来战士','法师'],169, 4],
            self::$h_map['德邦总管 赵信'] => ['德邦总管 赵信',2,['星神','圣盾使'],174, 5],
            self::$h_map['正义天使 凯尔'] => ['正义天使 凯尔',4,['女武神','剑士'],149, 10],
            self::$h_map['无极剑圣 易'] => ['无极剑圣 易',3,['奥德赛','剑士'],156, 11],
            self::$h_map['众星之子 索拉卡'] => ['众星之子 索拉卡',4,['星之守护者','秘术师'],166, 16],
            self::$h_map['赏金猎人 厄运小姐'] => ['赏金猎人 厄运小姐',5,['女武神','强袭枪手','佣兵'],157, 21],
            self::$h_map['寒冰射手 艾希'] => ['寒冰射手 艾希',3,['星神','狙神'],129, 22],
            self::$h_map['虚空恐惧 科加斯'] => ['虚空恐惧 科加斯',4,['虚空','斗士'],133, 31],
            self::$h_map['恶魔小丑 萨科'] => ['恶魔小丑 萨科',3,['暗星','刺客'],163, 35],
            self::$h_map['琴瑟仙女 娑娜'] => ['琴瑟仙女 娑娜',2,['奥德赛','秘术师'],165, 37],
            self::$h_map['虚空行者 卡萨丁'] => ['虚空行者 卡萨丁',3,['星神','破法战士'],148, 38],
            self::$h_map['刀锋舞者 艾瑞莉娅'] => ['刀锋舞者 艾瑞莉娅',4,['源计划','剑士','破法战士'],141, 39],
            self::$h_map['海洋之灾 普朗克'] => ['海洋之灾 普朗克',5,['太空海盗','佣兵','爆破专家'],139, 41],
            self::$h_map['天启者 卡尔玛'] => ['天启者 卡尔玛',3,['暗星','秘术师'],147, 43],
            self::$h_map['皮城女警 凯特琳'] => ['皮城女警 凯特琳',1,['未来战士','狙神'],132, 51],
            self::$h_map['蒸汽机器人 布里茨'] => ['蒸汽机器人 布里茨',2,['未来战士','斗士'],131, 53],
            self::$h_map['熔岩巨兽 墨菲特'] => ['熔岩巨兽 墨菲特',1,['奥德赛','斗士'],155, 54],
            self::$h_map['德玛西亚皇子 嘉文四世'] => ['德玛西亚皇子 嘉文四世',1,['暗星','圣盾使'],142, 59],
            self::$h_map['孙悟空 齐天大圣'] => ['孙悟空 齐天大圣',4,['未来战士','重装战士'],172, 62],
            self::$h_map['机械公敌 兰博'] => ['机械公敌 兰博',3,['银河魔装机神','爆破专家'],162, 68],
            self::$h_map['圣锤之毅 波比'] => ['圣锤之毅 波比',1,['星之守护者','重装战士'],160, 78],
            self::$h_map['探险家 伊泽瑞尔'] => ['探险家 伊泽瑞尔',3,['未来战士','强袭枪手'],136, 81],
            self::$h_map['铁铠冥魂 莫德凯撒'] => ['铁铠冥魂 莫德凯撒',2,['暗星','重装战士'],158, 82],
            self::$h_map['曙光女神 蕾欧娜'] => ['曙光女神 蕾欧娜',1,['源计划','重装战士'],151, 89],
            self::$h_map['暮光之眼 慎'] => ['暮光之眼 慎',2,['未来战士','剑士'],164, 98],
            self::$h_map['光辉女郎 拉克丝'] => ['光辉女郎 拉克丝',3,['暗星','法师'],154, 99],
            self::$h_map['远古巫灵 泽拉斯'] => ['远古巫灵 泽拉斯',5,['暗星','法师'],178,101],
            self::$h_map['九尾妖狐 阿狸'] => ['九尾妖狐 阿狸',2,['星之守护者','法师'],127, 103],
            self::$h_map['法外狂徒 格雷福斯'] => ['法外狂徒 格雷福斯',1,['太空海盗','强袭枪手'],140, 104],
            self::$h_map['潮汐海灵 菲兹'] => ['潮汐海灵 菲兹',4,['银河魔装机神','刺客'],138, 105],
            self::$h_map['无双剑姬 菲奥娜'] => ['无双剑姬 菲奥娜',1,['源计划','剑士'],137, 114],
            self::$h_map['爆破鬼才 吉格斯'] => ['爆破鬼才 吉格斯',1,['奥德赛','爆破专家'],176, 115],
            self::$h_map['仙灵女巫 璐璐'] => ['仙灵女巫 璐璐',5,['星神','秘术师'],153, 117],
            self::$h_map['虚空掠夺者 卡兹克'] => ['虚空掠夺者 卡兹克',1,['虚空','刺客'],150, 121],
            self::$h_map['诺克萨斯之手 德莱厄斯'] => ['诺克萨斯之手 德莱厄斯',2,['太空海盗','破法战士'],134, 122],
            self::$h_map['未来守护者 杰斯'] => ['未来守护者 杰斯',3,['太空海盗','重装战士'],143, 126],
            self::$h_map['暗黑元首 辛德拉'] => ['暗黑元首 辛德拉',3,['星之守护者','法师'],167, 134],
            self::$h_map['铸星龙王 奥瑞利安·索尔'] => ['铸星龙王 奥瑞利安·索尔',5,['奥德赛','星舰龙神'],130, 136],
            self::$h_map['暮光星灵 佐伊'] => ['暮光星灵 佐伊',1,['星之守护者','法师'],177, 142],
            self::$h_map['虚空之女 卡莎'] => ['虚空之女 卡莎',2,['女武神','刺客'],146, 145],
            self::$h_map['疾风剑豪 亚索'] => ['疾风剑豪 亚索',2,['奥德赛','剑士'],175, 157],
            self::$h_map['虚空之眼 维克兹'] => ['虚空之眼 维克兹',4,['虚空','法师'],170, 161],
            self::$h_map['戏命师 烬'] => ['戏命师 烬',4,['暗星','狙神'],144, 202],
            self::$h_map['暴走萝莉 金克丝'] => ['暴走萝莉 金克丝',4,['奥德赛','强袭枪手'],145, 222],
            self::$h_map['圣枪游侠 卢锡安'] => ['圣枪游侠 卢锡安',2,['源计划','强袭枪手'],152, 236],
            self::$h_map['时间刺客 艾克'] => ['时间刺客 艾克',5,['源计划','刺客'],135, 245],
            self::$h_map['皮城执法官 蔚'] => ['皮城执法官 蔚',3,['源计划','斗士'],171, 254],
            self::$h_map['魂锁典狱长 锤石'] => ['魂锁典狱长 锤石',5,['未来战士','破法战士'],168, 412],
            self::$h_map['幻翎 洛'] => ['幻翎 洛',2,['星神','圣盾使'],161, 497],
            self::$h_map['逆羽 霞'] => ['逆羽 霞',1,['星神','剑士'],173, 498],
            self::$h_map['万花通灵 妮蔻'] => ['万花通灵 妮蔻',3,['星之守护者','圣盾使'],159,518],
        ];
        $ret = [];
        foreach($hero_define as $id => $hero){
            $id = (int)$id;
            $ret[$id] = [
                self::name => $hero[self::name],
                self::cost => $hero[self::cost],
                self::group => [],
                self::img => $hero[self::img],
                self::lol_id => $hero[self::lol_id],
                self::id => $id,
                self::title => $hero[self::name] . "\n阵营:".join(',',$hero[self::group])."\n价格:".$hero[self::cost],
            ];
            //groupName2groupId
            foreach($hero[self::group] as $GName){
                $ret[$id][self::group][] = self::G_MAP[$GName];
            }
        }
        return $ret;
    }
    
    //返回阵营到英雄的映射
    static public function group2hero(){
        $ret = [];
        /*
        groupid =>[
            0=>$id,
            1=>id
        ]
        */
        foreach(self::heroList() as $item){
            foreach($item[self::group] as $group){
                $ret[$group][] = $item[self::id];
            }
        }
        return $ret;
    }

    //各阵容权重加成
    static public function groupValue(){

    }

}

//echo HERO::LIST[20][HERO::name];