<?php
class HERO{
    /**
     * hero列表的key
     */
    const name = 0;
    const cost = 1;
    const group = 2;
    const img = 3;
    const lol_id = 4;
    const id = 5; // front
    const title = 6; // front

    /**
     * 羁绊列表的key
     */
    const g_name = 0;
    const g_img = 1;
    const g_glevel = 2;
    const g_level = 3;
    const g_id = 4;

    /**
     * 级别与英雄概率对应关系
     */
    const LEVEL2COST = [
        1=>[1],
        2=>[1],
        3=>[1,2,3],
        4=>[1,2,3],
        5=>[1,2,3,4],
        6=>[1,2,3,4],
        7=>[1,2,3,4,5],
        8=>[1,2,3,4,5],
        9=>[1,2,3,4,5],
        ];
    /**
     * 羁绊id定义
     */
    const G_MAP = [
        701 => "星之守护者",
        702 => "银河魔装机神",
        703 => "星神",
        704 => "奥德赛",
        705 => "未来战士",
        // 706 => "虚空",
        706 => "太空海盗",
        707 => "源计划",
        708 => "暗星",
        // 710 => "女武神",
        709 => "战地机甲",
        710 => "宇航员",
        
        801 => "剑士",
        802 => "爆破专家",
        803 => "刺客",
        804 => "斗士",
        805 => "法师",
        806 => "圣盾使",
        807 => "狙神",
        808 => "秘术师",
        809 => "破法战士",
        810 => "强袭枪手",
        811 => "星舰龙神",
        812 => "佣兵",
        813 => "重装战士",
        814 => "大魔法使",

        "星之守护者" => 701,
        "银河魔装机神" => 702,
        "星神" => 703,
        "奥德赛" => 704,
        "未来战士" => 705,
        // "虚空" => 706,
        "太空海盗" => 706,
        "源计划" => 707,
        "暗星" => 708,
        // "女武神" => 710,
        "战地机甲" => 709,
        "宇航员" => 710,
        
        "剑士" => 801,
        "爆破专家" => 802,
        "刺客" => 803,
        "斗士" => 804,
        "法师" => 805,
        "圣盾使" => 806,
        "狙神" => 807,
        "秘术师" => 808,
        "破法战士" => 809,
        "强袭枪手" => 810,
        "星舰龙神" => 811,
        "佣兵" => 812,
        "重装战士" => 813,
        "大魔法使" => 814,
    ];
    /**
        var data = '';
        chess.data.forEach((item, index) => {
        // console.log(index, item);
        // console.log("'"+item.title + ' ' + item.displayName+"' => "+index+',');
        data = data + "'"+item.title + ' ' + item.displayName+"' => "+(index+200)+",\n";
        //'黑暗之女 安妮' => 200,
        });
        console.log(data);
     */
    const HERO_ID = [
        '黑暗之女 安妮' => 200,
        '卡牌大师 崔斯特' => 201,
        '德邦总管 赵信' => 202,
        '无畏战车 厄加特' => 203,
        '无极剑圣 易' => 204,
        '众星之子 索拉卡' => 205,
        '迅捷斥候 提莫' => 206,
        '寒冰射手 艾希' => 207,
        '恶魔小丑 萨科' => 208,
        '刀锋舞者 艾瑞莉娅' => 209,
        '风暴之怒 迦娜' => 210,
        '海洋之灾 普朗克' => 211,
        '天启者 卡尔玛' => 212,
        '皮城女警 凯特琳' => 213,
        '蒸汽机器人 布里茨' => 214,
        '熔岩巨兽 墨菲特' => 215,
        '永恒梦魇 魔腾' => 216,
        '德玛西亚皇子 嘉文四世' => 217,
        '齐天大圣 孙悟空' => 218,
        '暗夜猎手 薇恩' => 219,
        '机械公敌 兰博' => 220,
        '魔蛇之拥 卡西奥佩娅' => 221,
        '圣锤之毅 波比' => 222,
        '探险家 伊泽瑞尔' => 223,
        '铁铠冥魂 莫德凯撒' => 224,
        '曙光女神 蕾欧娜' => 225,
        '放逐之刃 锐雯' => 226,
        '深渊巨口 克格莫' => 227,
        '暮光之眼 慎' => 228,
        '远古巫灵 泽拉斯' => 229,
        '九尾妖狐 阿狸' => 230,
        '法外狂徒 格雷福斯' => 231,
        '潮汐海灵 菲兹' => 232,
        '深海泰坦 诺提勒斯' => 233,
        '机械先驱 维克托' => 234,
        '无双剑姬 菲奥娜' => 235,
        '爆破鬼才 吉格斯' => 236,
        '仙灵女巫 璐璐' => 237,
        '诺克萨斯之手 德莱厄斯' => 238,
        '未来守护者 杰斯' => 239,
        '暗黑元首 辛德拉' => 240,
        '铸星龙王 奥瑞利安·索尔' => 241,
        '暮光星灵 佐伊' => 242,
        '迷失之牙 纳尔' => 243,
        '疾风剑豪 亚索' => 244,
        '戏命师 烬' => 245,
        '暴走萝莉 金克丝' => 246,
        '圣枪游侠 卢锡安' => 247,
        '影流之主 劫' => 248,
        '时间刺客 艾克' => 249,
        '皮城执法官 蔚' => 250,
        '魂锁典狱长 锤石' => 251,
        '海兽祭司 俄洛伊' => 252,
        '星界游神 巴德' => 253,
        '幻翎 洛' => 254,
        '逆羽 霞' => 255,
        '万花通灵 妮蔻' => 256,
    ];
    //https://game.gtimg.cn/images/lol/act/img/tft/equip/317.png
    const WEAPON = [
        self::G_MAP['剑士'] => ['破败王者之剑',317],
        self::G_MAP['刺客'] => ['刺客的利爪',324],
        // self::G_MAP['爆破专家'] => ['爆破专家的电荷',331],
        self::G_MAP['战地机甲'] => ['战地机甲镀板',355],
        self::G_MAP['星之守护者'] => ['星之守护者的挂坠',337],
        self::G_MAP['奥德赛'] => ['奥德赛勋章',342],
        self::G_MAP['星神'] => ['星神的法球',346],
        self::G_MAP['圣盾使'] => ['圣盾使的胸甲',349],
        self::G_MAP['暗星'] => ['暗星之心',352],
    ];

    // public static $g_map = null;
    /**
     * 英雄map
     */
    public static $h_map = null;
    /**
     * 初始化
     */
    static public function init(){
        self::$h_map = self::HERO_ID;
        foreach(self::$h_map as $key => $item) {
            self::$h_map[$item] = $key;
        }
    }
    /**
     * 返回武器列表
     */
    static public function weaponList(){
        $ret = [];
        foreach(self::WEAPON as $groupId=>$item){
            $ret[$groupId] = [
                $item[1],
                $groupId,
                $item[0] . ' - 转职为' . self::G_MAP[$groupId],
                $item[0]
            ];
        }
        return $ret;
    }

    //不同数量阵营角色获取的buff级别
    const BF_1       = [ 1=>1, 2=>1 ,3=>1, 4=>1];
    const BF_2       = [ 1=>0, 2=>2 ,3=>2, 4=>2];
    const BF_2_4     = [ 1=>0, 2=>2, 3=>2, 4=>4, 5=>4, 6=>4];
    const BF_2_3_4   = [ 1=>0, 2=>2, 3=>3, 4=>4, 5=>4, 6=>4, 7=>4];
    const BF_2_4_6   = [ 1=>0, 2=>2, 3=>2, 4=>4, 5=>4, 6=>6, 7=>6, 8=>6, 9=>6];
    const BF_2_4_6_8 = [ 1=>0, 2=>2, 3=>2, 4=>4, 5=>4, 6=>6, 7=>6, 8=>8, 9=>8, 10=>8];
    const BF_3       = [ 1=>0, 2=>0, 3=>3, 4=>3, 5=>3, 6=>3];
    const BF_3_6     = [ 1=>0, 2=>0, 3=>3, 4=>3, 5=>3, 6=>6 ,7=>6, 8=>6, 9=>6, 10=>6];
    const BF_3_6_9   = [ 1=>0, 2=>0, 3=>3, 4=>3, 5=>3, 6=>6, 7=>6, 8=>6, 9=>9, 10=>9, 11=>9, 12=>9];

    //返回阵营列表
    static public function groupList(){
        $group = [
            //id                        name                img     low mid top     group
            self::G_MAP['星之守护者']     => ['星之守护者',   3101,   [3,6,9],    self::BF_3_6_9],
            self::G_MAP['银河魔装机神']   => ['银河魔装机神', 3102,   [0,0,3],    self::BF_3],
            self::G_MAP['星神']           => ['星神',         3103,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['奥德赛']         => ['奥德赛',       3104,   [3,6,9],    self::BF_3_6_9],
            self::G_MAP['未来战士']       => ['未来战士',     3105,   [2,4,[6,8]],self::BF_2_4_6_8],
            // self::G_MAP['虚空']           => ['虚空',         3106,   [0,0,3],    self::BF_3],
            self::G_MAP['太空海盗']       => ['太空海盗',     3107,   [2,0,4],    self::BF_2_4],
            self::G_MAP['源计划']         => ['源计划',       3108,   [3,0,6],    self::BF_3_6],
            self::G_MAP['暗星']           => ['暗星',         3109,   [2,4,[6,8]],self::BF_2_4_6_8],
            // self::G_MAP['女武神']         => ['女武神',       3110,   [0,0,2],    self::BF_2],
            self::G_MAP['战地机甲']       => ['战地机甲',     3111,   [2,4,[6,8]],self::BF_2_4_6_8],
            self::G_MAP['宇航员']         => ['宇航员',       3112,   [0,0,3],    self::BF_3],

            self::G_MAP['剑士']           => ['剑士',         3001,   [3,6,9],    self::BF_3_6_9],
            self::G_MAP['爆破专家']       => ['爆破专家',     3002,   [0,0,2],    self::BF_2],
            self::G_MAP['刺客']           => ['刺客',         3003,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['斗士']           => ['斗士',         3004,   [2,0,4],    self::BF_2_4],
            self::G_MAP['法师']           => ['法师',         3005,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['圣盾使']         => ['圣盾使',       3006,   [2,4,6],    self::BF_2_4_6],
            self::G_MAP['狙神']           => ['狙神',         3007,   [2,0,4],    self::BF_2],
            self::G_MAP['秘术师']         => ['秘术师',       3008,   [2,0,4],    self::BF_2_4],
            self::G_MAP['破法战士']       => ['破法战士',     3009,   [0,0,2],    self::BF_2],
            self::G_MAP['强袭枪手']       => ['强袭枪手',     3010,   [2,0,4],    self::BF_2_4],
            self::G_MAP['星舰龙神']       => ['星舰龙神',     3011,   [0,0,1],    self::BF_1],
            self::G_MAP['佣兵']           => ['佣兵',         3012,   [0,0,1],    self::BF_1],
            self::G_MAP['重装战士']       => ['重装战士',     3013,   [2,4,6],    self::BF_2_4],
            self::G_MAP['大魔法使']       => ['大魔法使',     3014,   [0,0,1],    self::BF_1],
        ];

        foreach($group as $gid => &$item){
            $item[self::g_id] = $gid;
        }
        return $group;
    }
    
    //返回英雄列表 包含名称 价格 阵营 id
    static public function heroList(){
        /**
         * 英雄，价格，阵营，图片id，lol_id
         * https://game.gtimg.cn/images/lol/act/img/tft/js/chess.js
        var data = '';
        chess.data.forEach((item, index) => {
            // console.log(index, item);
            // console.log("'"+item.title + ' ' + item.displayName+"' => "+index+',');
            index = index + 200;
            data = data + index + " => ['"+item.title + ' ' + item.displayName+"', "+item.price+", ['" + item.jobs +"','"+ item.races + "'], "+item.TFTID + ", " + item.chessId + "],\n";
            //self::$h_map['黑暗之女 安妮'] => ['黑暗之女 安妮',2,['银河魔装机神','法师'],128, 1],
        });
        console.log(data);
         */
        $hero_define = [
            200 => ['黑暗之女 安妮', 2, ['法师','银河魔装机神'], 128, 1],
            201 => ['卡牌大师 崔斯特', 1, ['法师','未来战士'], 169, 4],
            202 => ['德邦总管 赵信', 2, ['圣盾使','星神'], 174, 5],
            203 => ['无畏战车 厄加特', 5, ['圣盾使','战地机甲'], 191, 6],
            204 => ['无极剑圣 易', 3, ['剑士','奥德赛'], 156, 11],
            205 => ['众星之子 索拉卡', 4, ['秘术师','星之守护者'], 166, 16],
            206 => ['迅捷斥候 提莫', 4, ['狙神','宇航员'], 182, 17],
            207 => ['寒冰射手 艾希', 3, ['狙神','星神'], 129, 22],
            208 => ['恶魔小丑 萨科', 3, ['刺客','暗星'], 163, 35],
            209 => ['刀锋舞者 艾瑞莉娅', 4, ['剑士','破法战士','源计划'], 141, 39],
            210 => ['风暴之怒 迦娜', 5, ['大魔法使','星之守护者'], 192, 40],
            211 => ['海洋之灾 普朗克', 5, ['佣兵','爆破专家','太空海盗'], 139, 41],
            212 => ['天启者 卡尔玛', 3, ['秘术师','暗星'], 147, 43],
            213 => ['皮城女警 凯特琳', 1, ['狙神','未来战士'], 132, 51],
            214 => ['蒸汽机器人 布里茨', 2, ['斗士','未来战士'], 131, 53],
            215 => ['熔岩巨兽 墨菲特', 1, ['斗士','奥德赛'], 155, 54],
            216 => ['永恒梦魇 魔腾', 1, ['刺客','战地机甲'], 183, 56],
            217 => ['德玛西亚皇子 嘉文四世', 1, ['圣盾使','暗星'], 142, 59],
            218 => ['齐天大圣 孙悟空', 4, ['重装战士','未来战士'], 172, 62],
            219 => ['暗夜猎手 薇恩', 3, ['狙神','源计划'], 188, 67],
            220 => ['机械公敌 兰博', 3, ['爆破专家','银河魔装机神'], 162, 68],
            221 => ['魔蛇之拥 卡西奥佩娅', 3, ['秘术师','战地机甲'], 187, 69],
            222 => ['圣锤之毅 波比', 1, ['重装战士','星之守护者'], 160, 78],
            223 => ['探险家 伊泽瑞尔', 3, ['强袭枪手','未来战士'], 136, 81],
            224 => ['铁铠冥魂 莫德凯撒', 2, ['重装战士','暗星'], 158, 82],
            225 => ['曙光女神 蕾欧娜', 1, ['重装战士','源计划'], 151, 89],
            226 => ['放逐之刃 锐雯', 4, ['剑士','未来战士'], 190, 92],
            227 => ['深渊巨口 克格莫', 2, ['强袭枪手','战地机甲'], 185, 96],
            228 => ['暮光之眼 慎', 2, ['剑士','未来战士'], 164, 98],
            229 => ['远古巫灵 泽拉斯', 5, ['法师','暗星'], 178, 101],
            230 => ['九尾妖狐 阿狸', 2, ['法师','星之守护者'], 127, 103],
            231 => ['法外狂徒 格雷福斯', 1, ['强袭枪手','太空海盗'], 140, 104],
            232 => ['潮汐海灵 菲兹', 4, ['刺客','银河魔装机神'], 138, 105],
            233 => ['深海泰坦 诺提勒斯', 2, ['重装战士','宇航员'], 179, 111],
            234 => ['机械先驱 维克托', 4, ['法师','战地机甲'], 189, 112],
            235 => ['无双剑姬 菲奥娜', 1, ['剑士','源计划'], 137, 114],
            236 => ['爆破鬼才 吉格斯', 1, ['爆破专家','奥德赛'], 176, 115],
            237 => ['仙灵女巫 璐璐', 5, ['秘术师','星神'], 153, 117],
            238 => ['诺克萨斯之手 德莱厄斯', 2, ['破法战士','太空海盗'], 134, 122],
            239 => ['未来守护者 杰斯', 3, ['重装战士','太空海盗'], 143, 126],
            240 => ['暗黑元首 辛德拉', 3, ['法师','星之守护者'], 167, 134],
            241 => ['铸星龙王 奥瑞利安·索尔', 5, ['星舰龙神','奥德赛'], 130, 136],
            242 => ['暮光星灵 佐伊', 1, ['法师','星之守护者'], 177, 142],
            243 => ['迷失之牙 纳尔', 4, ['斗士','宇航员'], 181, 150],
            244 => ['疾风剑豪 亚索', 2, ['剑士','奥德赛'], 175, 157],
            245 => ['戏命师 烬', 4, ['狙神','暗星'], 144, 202],
            246 => ['暴走萝莉 金克丝', 4, ['强袭枪手','奥德赛'], 145, 222],
            247 => ['圣枪游侠 卢锡安', 2, ['强袭枪手','源计划'], 152, 236],
            248 => ['影流之主 劫', 2, ['刺客','奥德赛'], 186, 238],
            249 => ['时间刺客 艾克', 5, ['刺客','源计划'], 135, 245],
            250 => ['皮城执法官 蔚', 3, ['斗士','源计划'], 171, 254],
            251 => ['魂锁典狱长 锤石', 5, ['破法战士','未来战士'], 168, 412],
            252 => ['海兽祭司 俄洛伊', 1, ['斗士','战地机甲'], 184, 420],
            253 => ['星界游神 巴德', 3, ['秘术师','宇航员'], 180, 432],
            254 => ['幻翎 洛', 2, ['圣盾使','星神'], 161, 497],
            255 => ['逆羽 霞', 1, ['剑士','星神'], 173, 498],
            256 => ['万花通灵 妮蔻', 3, ['圣盾使','星之守护者'], 159, 518],
        ];
        $ret = [];
        foreach($hero_define as $id => $hero){
            $id = (int)$id;
            $ret[$id] = [
                self::name => $hero[self::name],
                self::cost => $hero[self::cost],
                self::group => [],
                self::img => $hero[self::img],
                self::lol_id => $hero[self::lol_id],
                self::id => $id,
                self::title => $hero[self::name] . "\n阵营:".join(',',$hero[self::group])."\n价格:".$hero[self::cost],
            ];
            //groupName2groupId
            foreach($hero[self::group] as $GName){
                $ret[$id][self::group][] = self::G_MAP[$GName];
            }
        }
        return $ret;
    }
    
    //返回阵营到英雄的映射
    static public function group2hero(){
        $ret = [];
        /*
        groupid =>[
            0=>$id,
            1=>id
        ]
        */
        foreach(self::heroList() as $item){
            foreach($item[self::group] as $group){
                $ret[$group][] = $item[self::id];
            }
            
        }
        return $ret;
    }

    //各阵容权重加成
    static public function groupValue(){

    }

}

//echo HERO::LIST[20][HERO::name];